/*************************************************************************************************************
*												测试说明
*1、MCU:STC89C52RC
*2、测试频率:11.0592Mhz
*2、编程语言:C51
*2、编译环境:Keil C
*2、功能:全速正转、全速反转、停止、调速运行
*************************************************************************************************************/

#include <reg52.h>

//LMD298输入控制端定义
sbit IN1 = P1^0;
sbit IN2 = P1^1;	
sbit IN3 = P1^2;	
sbit IN4 = P1^3;

sbit ENA = P1^4;	
sbit ENB = P1^5;

sbit CW = P3^0;		//正转运行按键
sbit STOP = P3^1;	//停止运行按键
sbit CCW = P3^2;	//反转运行按键
sbit ADJ = P3^3;	//调速运行按键

bit Run_Status;		//运行状态位标志，
					//=0表示电机在停止状态，可以按键正转、反转均可
					//=1表示电机在运行状态，不支持正反转按键，只有先停止。防止强行换向带来的电流过大。

unsigned char CYCLE; //周期变量
unsigned char DUTY; //占空比变量,对应于调速运行时按键次数，调速时每按一次调速键速度比上次变化10%

/********************************/
/*      延时函数               */
/********************************/
void Delay(unsigned int cnt)
{
 	while(--cnt);
}
/********************************/
/*      主函数		             */
/********************************/
main()
{
	TMOD |=0x01;	//定时器设置 1ms in 12M crystal
	TH0=(65536-1000)/256; 
	TL0=(65536-1000)%256;//定时1mS 
	IE= 0x82;  		//打开中断	
	
	Run_Status=0;
	IN1=1;
	IN2=1;
	IN3=1;
	IN4=1;
	ENA=0;
	ENB=0;

	CYCLE=10; 	//周期10ms
	DUTY=0; 	//占空比=0

	while(1)
  	{
		if(!STOP)			//任何时候按停止键，电机停止运行
		{	
			Delay(12000);	//延时去抖动
			if(!STOP)			
			{		
				//实际运用中，自由停车或制动刹车可以任选。
				Run_Status=0;	//电机正在停止的状态标志
				IN1=1;			//IN1=IN2时，电机1制动刹车
				IN2=1;			
				ENA=0;			//ENA=0时，电机1自由运行到停止
				IN3=1;			//IN3=IN4时，电机2制动刹车
				IN4=1;			
				ENB=0;			//ENB=0时，电机2自由运行到停止
				TR0=0;
			}
		}
		if(!CW&&!Run_Status)//按正转键同时电机不是正在运行时，电机正转运行
		{
			Delay(12000);	//延时去抖动
			if(!CW&&!Run_Status)			
			{	
				Run_Status=1;	//电机正在运行的状态标志
				IN1=1;			
				IN2=0;			
				ENA=1;	
				IN3=1;			
				IN4=0;			
				ENB=1;	
			}
		}
  		if(!CCW&&!Run_Status)//按反转键同时电机不是正在运行时，电机反转运行
		{
			Delay(12000);	//延时去抖动
			if(!CCW&&!Run_Status)			
			{	
				Run_Status=1;	//电机正在运行的状态标志
				IN1=0;			
				IN2=1;			
				ENA=1;	
				IN3=0;			
				IN4=1;			
				ENB=1;	
			}
		}
	   	if(!ADJ)
		{
			Delay(15000);	//延时去抖动
			if(!ADJ)
			{	
				TR0=1;
				if(DUTY<CYCLE)	DUTY+=1;	//增加占空比
				else			DUTY=0;
				Run_Status=1;
				//这里是正转调速，反转调速可以自己试着编写
				IN1=1;			
				IN2=0;			
				ENA=0;	
				IN3=1;			
				IN4=0;			
				ENB=0;	
		 	}
		}
   }
}
/********************************/
/*      定时器0中断服务函数     */
/********************************/
void Timer0(void) interrupt 1 using 1
{
	static unsigned char Cnt;

	TH0=(65536-1000)/256; 
	TL0=(65536-1000)%256;//定时1mS 
	
	if(DUTY==0)				{Cnt=0;	TR0=0;Run_Status=0;}	//占空比=0时 停止中断 可以按正转或反转
	else if(DUTY==CYCLE)	Cnt=CYCLE;
	else					Cnt++;
	if(Cnt==DUTY)		//高电平时间到
	{
	 	ENA = 0; 
		ENB = 0; 
	}
	if(Cnt == CYCLE)	//低电平时间到
	{
		ENA = 1; 
		ENB = 1; 
	    Cnt=0;
	}
}