/*************************************************************************************************************
*												测试说明
*1、MCU:STC89C52RC
*2、测试频率:11.0592Mhz
*2、编程语言:C51
*2、编译环境:Keil C
*2、功能:定时正反转
*************************************************************************************************************/

#include <reg52.h>

//LMD298输入控制端定义
sbit IN1 = P1^0;
sbit IN2 = P1^1;	
sbit IN3 = P1^2;	
sbit IN4 = P1^3;

sbit ENA = P1^4;	
sbit ENB = P1^5;

unsigned int Cnt;


/********************************/
/*      主函数		             */
/********************************/
main()
{
	TMOD |=0x01;	//定时器设置 1ms in 12M crystal
	TH0=(65536-1000)/256; 
	TL0=(65536-1000)%256;//定时1mS 
	IE= 0x82;  		//打开中断	
	TR0=1;

	IN1=1;//停止
	IN2=1;
	IN3=1;
	IN4=1;
	ENA=0;
	ENB=0;

	while(1) 
  	{
		if(Cnt==1000)//1S后正转
		{
			IN1=1;			
			IN2=0;			
			ENA=1;	
			IN3=1;			
			IN4=0;			
			ENB=1;	
		}
		if(Cnt==5000)//5s时停止
		{
			IN1=1;
			IN2=1;
			IN3=1;
			IN4=1;
			ENA=0;
			ENB=0;
		}
  		if(Cnt==6000)//6s时反转
		{
			IN1=0;			
			IN2=1;			
			ENA=1;	
			IN3=0;			
			IN4=1;			
			ENB=1;	
		}
		if(Cnt==10000)//10s时停止
		{
			IN1=1;
			IN2=1;
			IN3=1;
			IN4=1;
			ENA=0;
			ENB=0;
			Cnt=0;
		}
  }
}
/********************************/
/*      定时器0中断服务函数     */
/********************************/
void Timer0(void) interrupt 1 using 1
{
	TH0=(65536-1000)/256; 
	TL0=(65536-1000)%256;//定时1mS 
	
	Cnt++;
}